It's not good to rely on `count` for a _set_ of items (i.e. items whose values are uniquely different from each other), because its harder to manage and not a proper representation of the state - it means you open yourself up (or worse, other developers) to unexpected state changes when coming back months or years later.

I've confirmed you can easily move the resources with `terraform mv`, which is even either when using the `moved` block:

```
moved {
  from = aws_route53_record.mailgun_records[0]
  to   = aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"]
}
moved {
  from = aws_route53_record.mailgun_records[1]
  to   = aws_route53_record.mailgun_records["email.my-domain-1234567891.com"]
}
moved {
  from = aws_route53_record.mailgun_records[2]
  to   = aws_route53_record.mailgun_records["my-domain-1234567891.com"]
}
```

You do have to figure out which index in the list holds what unique item (which is why using a set is a better type here): 

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.mailgun_records["_domainkey.my-domain-1234567891.com"] must be replaced
  # (moved from aws_route53_record.mailgun_records[0])
-/+ resource "aws_route53_record" "mailgun_records" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "my-domain-1234567891.com" -> (known after apply)
      ~ id              = "Z055174026N06MOMUYHWB_my-domain-1234567891.com._TXT" -> (known after apply)
      ~ name            = "my-domain-1234567891.com" -> "k1._domainkey.my-domain-1234567891.com" # forces replacement
      ~ records         = [
          + "k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDZyYWhRwL8Og6znnbzEeDAQ5mqXJ1cFzIEczBJqFSQdU5UBAIBoiC4ddsDXACS6/dQS66YHneO8KEdezkuiE1VO7ekzu48QwZHCgrWPB6CeC7hkHUJ8Y0cfrs2Ao7cVnuF8Qq/wyPBr77Gjjwr2nRd5I2s9cssRxrIz7K0Sm50mQIDAQAB",
          - "v=spf1 include:mailgun.org ~all",
        ]
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.mailgun_records["email.my-domain-1234567891.com"] must be replaced
  # (moved from aws_route53_record.mailgun_records[1])
-/+ resource "aws_route53_record" "mailgun_records" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "k1._domainkey.my-domain-1234567891.com" -> (known after apply)
      ~ id              = "Z055174026N06MOMUYHWB_k1._domainkey.my-domain-1234567891.com._TXT" -> (known after apply)
      ~ name            = "k1._domainkey.my-domain-1234567891.com" -> "email.my-domain-1234567891.com" # forces replacement
      ~ records         = [
          - "k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDZyYWhRwL8Og6znnbzEeDAQ5mqXJ1cFzIEczBJqFSQdU5UBAIBoiC4ddsDXACS6/dQS66YHneO8KEdezkuiE1VO7ekzu48QwZHCgrWPB6CeC7hkHUJ8Y0cfrs2Ao7cVnuF8Qq/wyPBr77Gjjwr2nRd5I2s9cssRxrIz7K0Sm50mQIDAQAB",
          + "mailgun.org",
        ]
      ~ type            = "TXT" -> "CNAME"
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.mailgun_records["my-domain-1234567891.com"] must be replaced
  # (moved from aws_route53_record.mailgun_records[2])
-/+ resource "aws_route53_record" "mailgun_records" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "email.my-domain-1234567891.com" -> (known after apply)
      ~ id              = "Z055174026N06MOMUYHWB_email.my-domain-1234567891.com._CNAME" -> (known after apply)
      ~ name            = "email.my-domain-1234567891.com" -> "my-domain-1234567891.com" # forces replacement
      ~ records         = [
          - "mailgun.org",
          + "v=spf1 include:mailgun.org ~all",
        ]
      ~ type            = "CNAME" -> "TXT"
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
```